{
  "backend/main.mo": "Main Motoko actor implementing a social media backend with user profiles, posts, stories, messages, follow/unfollow, likes, comments, and access control using Map/Set data structures and blob storage integration.",
  "feature_evidence.json": "Feature evidence report documenting implemented features (feed, profiles, upload, interactions, follow, stories, messages, explore) with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing React components, pages, hooks, and styling for the Instagram clone application.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS variables for light and dark themes with monochromatic palette and custom styling.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for all pages, authentication flow, theme provider, and profile setup modal logic.",
  "frontend/src/components/CommentSection.tsx": "Component displaying post comments with author profiles, timestamps, and a form for submitting new comments with loading states.",
  "frontend/src/components/FollowButton.tsx": "Smart button component that toggles between follow/unfollow states based on current following status with mutation handling and loading indicators.",
  "frontend/src/components/FollowListModal.tsx": "Modal dialog that displays a list of followers or following users with their profiles, avatars, and follow buttons. Fetches and renders user data for each principal in the list.",
  "frontend/src/components/ImageFilterPreview.tsx": "Component that displays an image preview with selectable CSS filters (None, Bright, Contrast, Saturate). Allows users to apply different visual effects to images.",
  "frontend/src/components/Layout.tsx": "Main application layout with sticky header navigation, mobile bottom nav bar, and footer. Includes logout functionality and links to feed, explore, upload, messages, and profile pages.",
  "frontend/src/components/MessageBubble.tsx": "Renders individual chat message bubbles with content and timestamp, styled differently for own messages vs received messages.",
  "frontend/src/components/PostCard.tsx": "Displays a complete post card with author avatar, username, timestamp, image, interactions, and caption. Main component for rendering posts in feeds.",
  "frontend/src/components/PostDetailModal.tsx": "Modal dialog wrapper that displays a PostCard in a larger overlay view for detailed post viewing.",
  "frontend/src/components/PostGrid.tsx": "Renders posts in a 3-column grid layout with clickable thumbnails that open PostDetailModal when selected.",
  "frontend/src/components/PostInteractions.tsx": "Handles post interactions including like, comment, and share buttons with counts. Toggles comment section visibility and manages interaction mutations.",
  "frontend/src/components/ProfileEditModal.tsx": "Modal form for editing user profile with username and bio fields. Loads current profile data and saves updates via mutation.",
  "frontend/src/components/ProfileSetupModal.tsx": "Non-dismissible modal for first-time profile setup requiring username and optional bio. Shown to new users to complete their profile.",
  "frontend/src/components/StoriesBar.tsx": "Horizontal scrollable bar displaying story avatars with gradient borders for users with active stories. Includes button to upload own story and filters stories by 24-hour recency.",
  "frontend/src/components/StoryUploadModal.tsx": "Modal component for uploading story images/videos with file preview, progress tracking, and integration with the usePostStory mutation hook.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages the backend actor instance, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with admin tokens.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend operations including user profiles, posts, stories, messages, comments, likes, follows, and explore feed with mutation invalidation logic.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors, border radius, and utility classes for hiding scrollbars.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider wrappers around the main App component.",
  "frontend/src/pages/ExplorePage.tsx": "Page component displaying a grid of explore posts fetched via useGetExplorePosts hook with loading state.",
  "frontend/src/pages/FeedPage.tsx": "Main feed page showing stories bar and chronological list of posts from followed users with loading and empty states.",
  "frontend/src/pages/LoginPage.tsx": "Landing page with branded UI for initiating Internet Identity login flow with loading state handling.",
  "frontend/src/pages/MessagesPage.tsx": "Displays a list of conversations with users the current user follows, showing avatars and usernames with links to individual message threads.",
  "frontend/src/pages/MessageThreadPage.tsx": "Direct message thread view with message history, real-time scrolling, and message input form for conversations with a specific user.",
  "frontend/src/pages/ProfilePage.tsx": "Renders a user profile page with avatar, bio, follower/following counts, and a grid of posts; includes edit profile functionality for own profile and follow button for others.",
  "frontend/src/pages/StoryViewerPage.tsx": "Full-screen story viewer that auto-advances through a user's stories every 5 seconds with progress bars, navigation controls, and auto-close when finished.",
  "frontend/src/pages/UploadPage.tsx": "Handles post creation with file upload, image filter preview, caption input, and upload progress tracking before sharing to the feed.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, and animation keyframes for accordion components.",
  "project_state.json": "Project state file for an Instagram clone social media app tracking 9 existing features (feed, profiles, uploads, interactions, stories, DMs, explore) and architectural requirements. Contains schema version 1.0.0, project state version 3, with image requirements for avatars, logos, and empty state illustrations."
}